1.GIT- распределение системы контроля версий
2.
3.
4.Репозиторий - хранилище ваших файлов который вы отслеживаете при помощи гита, и их изменение
5.
6.Команды Git
7.
8. 1.git init - она создает новый гит репозиторий локально на вашем пк, создаст она в той директории где вы запускаете эту команду (запускается только один раз)
 9. 
10.2. Git add - когда мы создаем изменяем файлы то при помощи этой команды мы загружаем все измещения в промежуточные место хранение 
12.git add <file name>
13.git add . - все в текущей директорий 
14.
15. 3. git commit - как только мы достигаем до определенного момента в разработке, то мы тогда сохраняем и комментируем все наши изменения в репозиторий. 
(Фиксация изменение в репо)
16. 
17. 
18. git commit -m '< >